arduino/ArduinoCore-samd/boards.txt
# Adafruit QT Py M0 (SAMD21)
# ------------------------------
adafruit_qtpy_m0.name=Adafruit QT PY (SAMD21)
adafruit_qtpy_m0.vid.0=0x239A
adafruit_qtpy_m0.pid.0=0x80CB
adafruit_qtpy_m0.vid.1=0x239A
adafruit_qtpy_m0.pid.1=0x00CB
adafruit_qtpy_m0.vid.1=0x239A
adafruit_qtpy_m0.pid.1=0x00CC
adafruit_qtpy_m0.upload.tool=bossac
adafruit_qtpy_m0.upload.protocol=sam-ba
adafruit_qtpy_m0.upload.maximum_size=262144
adafruit_qtpy_m0.upload.offset=0x2000
adafruit_qtpy_m0.upload.use_1200bps_touch=true
adafruit_qtpy_m0.upload.wait_for_upload_port=true
adafruit_qtpy_m0.upload.native_usb=true
adafruit_qtpy_m0.build.mcu=cortex-m0plus
adafruit_qtpy_m0.build.f_cpu=48000000L
adafruit_qtpy_m0.build.usb_product="QT Py M0"
adafruit_qtpy_m0.build.usb_manufacturer="Adafruit"
adafruit_qtpy_m0.build.board=QTPY_M0
adafruit_qtpy_m0.build.core=arduino
adafruit_qtpy_m0.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_QTPY_M0 -D__SAMD21E18A__ -DARM_MATH_CM0PLUS -DADAFRUIT_ARCH_SAMD {build.usb_flags}
adafruit_qtpy_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_qtpy_m0.build.openocdscript=openocd_scripts/trinket_m0.cfg
adafruit_qtpy_m0.build.variant=qtpy_m0
adafruit_qtpy_m0.build.variant_system_lib=
adafruit_qtpy_m0.build.vid=0x239A
adafruit_qtpy_m0.build.pid=0x80CB
adafruit_qtpy_m0.bootloader.tool=openocd
adafruit_qtpy_m0.bootloader.file=qtpyM0/bootloader-qtpy_m0.bin
adafruit_qtpy_m0.menu.opt.small=Small (-Os) (standard)
adafruit_qtpy_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_qtpy_m0.menu.opt.fast=Fast (-O2)
adafruit_qtpy_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_qtpy_m0.menu.opt.faster=Faster (-O3)
adafruit_qtpy_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_qtpy_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_qtpy_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_qtpy_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_qtpy_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_qtpy_m0.menu.usbstack.arduino=Arduino
adafruit_qtpy_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_qtpy_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_qtpy_m0.menu.debug.off=Off
adafruit_qtpy_m0.menu.debug.on=On
adafruit_qtpy_m0.menu.debug.on.build.flags.debug=-g

# Adafruit NeoPixel Trinkey (SAMD21)
# ------------------------------
adafruit_neotrinkey_m0.name=Adafruit Neo Trinkey (SAMD21)
adafruit_neotrinkey_m0.vid.0=0x239A
adafruit_neotrinkey_m0.pid.0=0x80EF
adafruit_neotrinkey_m0.vid.1=0x239A
adafruit_neotrinkey_m0.pid.1=0x00EF
adafruit_neotrinkey_m0.vid.1=0x239A
adafruit_neotrinkey_m0.pid.1=0x80F0
adafruit_neotrinkey_m0.upload.tool=bossac
adafruit_neotrinkey_m0.upload.protocol=sam-ba
adafruit_neotrinkey_m0.upload.maximum_size=262144
adafruit_neotrinkey_m0.upload.offset=0x2000
adafruit_neotrinkey_m0.upload.use_1200bps_touch=true
adafruit_neotrinkey_m0.upload.wait_for_upload_port=true
adafruit_neotrinkey_m0.upload.native_usb=true
adafruit_neotrinkey_m0.build.mcu=cortex-m0plus
adafruit_neotrinkey_m0.build.f_cpu=48000000L
adafruit_neotrinkey_m0.build.usb_product="NeoPixel Trinkey M0"
adafruit_neotrinkey_m0.build.usb_manufacturer="Adafruit"
adafruit_neotrinkey_m0.build.board=NEOTRINKEY_M0
adafruit_neotrinkey_m0.build.core=arduino
adafruit_neotrinkey_m0.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_NEOTRINKEY_M0 -D__SAMD21E18A__ -DARM_MATH_CM0PLUS -DADAFRUIT_ARCH_SAMD {build.usb_flags}
adafruit_neotrinkey_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_neotrinkey_m0.build.openocdscript=openocd_scripts/neotrinkey_m0.cfg
adafruit_neotrinkey_m0.build.variant=neotrinkey_m0
adafruit_neotrinkey_m0.build.variant_system_lib=
adafruit_neotrinkey_m0.build.vid=0x239A
adafruit_neotrinkey_m0.build.pid=0x80EF
adafruit_neotrinkey_m0.bootloader.tool=openocd
adafruit_neotrinkey_m0.bootloader.file=neotrinkey_m0/bootloader-neotrinkey_m0.bin
adafruit_neotrinkey_m0.menu.opt.small=Small (-Os) (standard)
adafruit_neotrinkey_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_neotrinkey_m0.menu.opt.fast=Fast (-O2)
adafruit_neotrinkey_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_neotrinkey_m0.menu.opt.faster=Faster (-O3)
adafruit_neotrinkey_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_neotrinkey_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_neotrinkey_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_neotrinkey_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_neotrinkey_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_neotrinkey_m0.menu.usbstack.arduino=Arduino
adafruit_neotrinkey_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_neotrinkey_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_neotrinkey_m0.menu.debug.off=Off
adafruit_neotrinkey_m0.menu.debug.on=On
adafruit_neotrinkey_m0.menu.debug.on.build.flags.debug=-g

# Adafruit Rotary Trinkey (SAMD21)
# ------------------------------
adafruit_rotarytrinkey_m0.name=Adafruit Rotary Trinkey (SAMD21)
adafruit_rotarytrinkey_m0.vid.0=0x239A
adafruit_rotarytrinkey_m0.pid.0=0x80FB
adafruit_rotarytrinkey_m0.vid.1=0x239A
adafruit_rotarytrinkey_m0.pid.1=0x00FB
adafruit_rotarytrinkey_m0.vid.1=0x239A
adafruit_rotarytrinkey_m0.pid.1=0x80FC
adafruit_rotarytrinkey_m0.upload.tool=bossac
adafruit_rotarytrinkey_m0.upload.protocol=sam-ba
adafruit_rotarytrinkey_m0.upload.maximum_size=262144
adafruit_rotarytrinkey_m0.upload.offset=0x2000
adafruit_rotarytrinkey_m0.upload.use_1200bps_touch=true
adafruit_rotarytrinkey_m0.upload.wait_for_upload_port=true
adafruit_rotarytrinkey_m0.upload.native_usb=true
adafruit_rotarytrinkey_m0.build.mcu=cortex-m0plus
adafruit_rotarytrinkey_m0.build.f_cpu=48000000L
adafruit_rotarytrinkey_m0.build.usb_product="Rotary Trinkey M0"
adafruit_rotarytrinkey_m0.build.usb_manufacturer="Adafruit"
adafruit_rotarytrinkey_m0.build.board=ROTARYTRINKEY_M0
adafruit_rotarytrinkey_m0.build.core=arduino
adafruit_rotarytrinkey_m0.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_ROTARYTRINKEY_M0 -D__SAMD21E18A__ -DARM_MATH_CM0PLUS -DADAFRUIT_ARCH_SAMD {build.usb_flags}
adafruit_rotarytrinkey_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_rotarytrinkey_m0.build.openocdscript=openocd_scripts/rotarytrinkey_m0.cfg
adafruit_rotarytrinkey_m0.build.variant=rotarytrinkey_m0
adafruit_rotarytrinkey_m0.build.variant_system_lib=
adafruit_rotarytrinkey_m0.build.vid=0x239A
adafruit_rotarytrinkey_m0.build.pid=0x80FB
adafruit_rotarytrinkey_m0.bootloader.tool=openocd
adafruit_rotarytrinkey_m0.bootloader.file=rotarytrinkey_m0/bootloader-rotarytrinkey_m0.bin
adafruit_rotarytrinkey_m0.menu.opt.small=Small (-Os) (standard)
adafruit_rotarytrinkey_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_rotarytrinkey_m0.menu.opt.fast=Fast (-O2)
adafruit_rotarytrinkey_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_rotarytrinkey_m0.menu.opt.faster=Faster (-O3)
adafruit_rotarytrinkey_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_rotarytrinkey_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_rotarytrinkey_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_rotarytrinkey_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_rotarytrinkey_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_rotarytrinkey_m0.menu.usbstack.arduino=Arduino
adafruit_rotarytrinkey_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_rotarytrinkey_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_rotarytrinkey_m0.menu.debug.off=Off
adafruit_rotarytrinkey_m0.menu.debug.on=On
adafruit_rotarytrinkey_m0.menu.debug.on.build.flags.debug=-g

# Adafruit NeoKey Trinkey (SAMD21)
# ------------------------------
adafruit_neokeytrinkey_m0.name=Adafruit NeoKey Trinkey (SAMD21)
adafruit_neokeytrinkey_m0.vid.0=0x239A
adafruit_neokeytrinkey_m0.pid.0=0x80FF
adafruit_neokeytrinkey_m0.vid.1=0x239A
adafruit_neokeytrinkey_m0.pid.1=0x00FF
adafruit_neokeytrinkey_m0.vid.1=0x239A
adafruit_neokeytrinkey_m0.pid.1=0x8100
adafruit_neokeytrinkey_m0.upload.tool=bossac
adafruit_neokeytrinkey_m0.upload.protocol=sam-ba
adafruit_neokeytrinkey_m0.upload.maximum_size=262144
adafruit_neokeytrinkey_m0.upload.offset=0x2000
adafruit_neokeytrinkey_m0.upload.use_1200bps_touch=true
adafruit_neokeytrinkey_m0.upload.wait_for_upload_port=true
adafruit_neokeytrinkey_m0.upload.native_usb=true
adafruit_neokeytrinkey_m0.build.mcu=cortex-m0plus
adafruit_neokeytrinkey_m0.build.f_cpu=48000000L
adafruit_neokeytrinkey_m0.build.usb_product="NeoKey Trinkey M0"
adafruit_neokeytrinkey_m0.build.usb_manufacturer="Adafruit"
adafruit_neokeytrinkey_m0.build.board=NEOKEYTRINKEY_M0
adafruit_neokeytrinkey_m0.build.core=arduino
adafruit_neokeytrinkey_m0.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_NEOKEYTRINKEY_M0 -D__SAMD21E18A__ -DARM_MATH_CM0PLUS -DADAFRUIT_ARCH_SAMD {build.usb_flags}
adafruit_neokeytrinkey_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_neokeytrinkey_m0.build.openocdscript=openocd_scripts/neokeytrinkey_m0.cfg
adafruit_neokeytrinkey_m0.build.variant=neokeytrinkey_m0
adafruit_neokeytrinkey_m0.build.variant_system_lib=
adafruit_neokeytrinkey_m0.build.vid=0x239A
adafruit_neokeytrinkey_m0.build.pid=0x80FF
adafruit_neokeytrinkey_m0.bootloader.tool=openocd
adafruit_neokeytrinkey_m0.bootloader.file=neokeytrinkey_m0/bootloader-neokeytrinkey_m0.bin
adafruit_neokeytrinkey_m0.menu.opt.small=Small (-Os) (standard)
adafruit_neokeytrinkey_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_neokeytrinkey_m0.menu.opt.fast=Fast (-O2)
adafruit_neokeytrinkey_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_neokeytrinkey_m0.menu.opt.faster=Faster (-O3)
adafruit_neokeytrinkey_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_neokeytrinkey_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_neokeytrinkey_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_neokeytrinkey_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)

