arduino/ArduinoCore-samd/boards.txt
# Adafruit Feather M4 CAN (SAME51)
# ------------------------------
adafruit_feather_m4_can.name=Adafruit Feather M4 CAN (SAME51)
adafruit_feather_m4_can.vid.0=0x239A
adafruit_feather_m4_can.pid.0=0x80CD
adafruit_feather_m4_can.vid.1=0x239A
adafruit_feather_m4_can.pid.1=0x00CD
adafruit_feather_m4_can.upload.tool=bossac18
adafruit_feather_m4_can.upload.protocol=sam-ba
adafruit_feather_m4_can.upload.maximum_size=507904
adafruit_feather_m4_can.upload.offset=0x4000
adafruit_feather_m4_can.upload.use_1200bps_touch=true
adafruit_feather_m4_can.upload.wait_for_upload_port=true
adafruit_feather_m4_can.upload.native_usb=true
adafruit_feather_m4_can.build.mcu=cortex-m4
#adafruit_feather_m4_can.build.f_cpu=120000000L
adafruit_feather_m4_can.build.usb_product="Adafruit Feather M4 CAN"
adafruit_feather_m4_can.build.usb_manufacturer="Adafruit LLC"
adafruit_feather_m4_can.build.board=FEATHER_M4_CAN
adafruit_feather_m4_can.build.core=arduino
adafruit_feather_m4_can.build.extra_flags=-D__SAME51J19A__ -DADAFRUIT_FEATHER_M4_EXPRESS -DADAFRUIT_FEATHER_M4_CAN -D__SAMD51__ -DADAFRUIT_ARCH_SAMD {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
adafruit_feather_m4_can.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_feather_m4_can.build.openocdscript=openocd_scripts/arduino_zero.cfg
adafruit_feather_m4_can.build.variant=feather_m4_can
adafruit_feather_m4_can.build.variant_system_lib=
adafruit_feather_m4_can.build.vid=0x239A
adafruit_feather_m4_can.build.pid=0x80CD
adafruit_feather_m4_can.bootloader.tool=openocd
adafruit_feather_m4_can.bootloader.file=featherM4/bootloader-feather_m4_express-v2.0.0-adafruit.5.bin
adafruit_feather_m4_can.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
adafruit_feather_m4_can.menu.cache.on=Enabled
adafruit_feather_m4_can.menu.cache.on.build.cache_flags=-DENABLE_CACHE
adafruit_feather_m4_can.menu.cache.off=Disabled
adafruit_feather_m4_can.menu.cache.off.build.cache_flags=
adafruit_feather_m4_can.menu.speed.120=120 MHz (standard)
adafruit_feather_m4_can.menu.speed.120.build.f_cpu=120000000L
adafruit_feather_m4_can.menu.speed.150=150 MHz (overclock)
adafruit_feather_m4_can.menu.speed.150.build.f_cpu=150000000L
adafruit_feather_m4_can.menu.speed.180=180 MHz (overclock)
adafruit_feather_m4_can.menu.speed.180.build.f_cpu=180000000L
adafruit_feather_m4_can.menu.speed.200=200 MHz (overclock)
adafruit_feather_m4_can.menu.speed.200.build.f_cpu=200000000L
adafruit_feather_m4_can.menu.opt.small=Small (-Os) (standard)
adafruit_feather_m4_can.menu.opt.small.build.flags.optimize=-Os
adafruit_feather_m4_can.menu.opt.fast=Fast (-O2)
adafruit_feather_m4_can.menu.opt.fast.build.flags.optimize=-O2
adafruit_feather_m4_can.menu.opt.faster=Faster (-O3)
adafruit_feather_m4_can.menu.opt.faster.build.flags.optimize=-O3
adafruit_feather_m4_can.menu.opt.fastest=Fastest (-Ofast)
adafruit_feather_m4_can.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_feather_m4_can.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_feather_m4_can.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_feather_m4_can.menu.maxqspi.50=50 MHz (standard)
adafruit_feather_m4_can.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
adafruit_feather_m4_can.menu.maxqspi.fcpu=CPU Speed / 2
adafruit_feather_m4_can.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
adafruit_feather_m4_can.menu.usbstack.arduino=Arduino
adafruit_feather_m4_can.menu.usbstack.tinyusb=TinyUSB
adafruit_feather_m4_can.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_feather_m4_can.menu.debug.off=Off
adafruit_feather_m4_can.menu.debug.on=On
adafruit_feather_m4_can.menu.debug.on.build.flags.debug=-g


# Adafruit Trellis M4 (SAMD51)
# ------------------------------
adafruit_trellis_m4.name=Adafruit Trellis M4 (SAMD51)
adafruit_trellis_m4.vid.0=0x239A
adafruit_trellis_m4.pid.0=0x802F
adafruit_trellis_m4.vid.1=0x239A
adafruit_trellis_m4.pid.1=0x002F
adafruit_trellis_m4.vid.2=0x239A
adafruit_trellis_m4.pid.2=0x0030
adafruit_trellis_m4.upload.tool=bossac18
adafruit_trellis_m4.upload.protocol=sam-ba
adafruit_trellis_m4.upload.maximum_size=507904
adafruit_trellis_m4.upload.offset=0x4000
adafruit_trellis_m4.upload.use_1200bps_touch=true
adafruit_trellis_m4.upload.wait_for_upload_port=true
adafruit_trellis_m4.upload.native_usb=true
adafruit_trellis_m4.build.mcu=cortex-m4
#adafruit_trellis_m4.build.f_cpu=120000000L
adafruit_trellis_m4.build.usb_product="Adafruit Trellis M4"
adafruit_trellis_m4.build.usb_manufacturer="Adafruit LLC"
adafruit_trellis_m4.build.board=TRELLIS_M4
adafruit_trellis_m4.build.core=arduino
adafruit_trellis_m4.build.extra_flags=-D__SAMD51G19A__ -DADAFRUIT_TRELLIS_M4_EXPRESS -D__SAMD51__ -DADAFRUIT_ARCH_SAMD {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -DCRYSTALLESS -mfloat-abi=hard -mfpu=fpv4-sp-d16
adafruit_trellis_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_trellis_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
adafruit_trellis_m4.build.variant=trellis_m4
adafruit_trellis_m4.build.variant_system_lib=
adafruit_trellis_m4.build.vid=0x239A
adafruit_trellis_m4.build.pid=0x802F
adafruit_trellis_m4.bootloader.tool=openocd
adafruit_trellis_m4.bootloader.file=trellisM4/bootloader-trellis_m4-v2.0.0-adafruit.5.bin
adafruit_trellis_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
adafruit_trellis_m4.menu.cache.on=Enabled
adafruit_trellis_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
adafruit_trellis_m4.menu.cache.off=Disabled
adafruit_trellis_m4.menu.cache.off.build.cache_flags=
adafruit_trellis_m4.menu.speed.120=120 MHz (standard)
adafruit_trellis_m4.menu.speed.120.build.f_cpu=120000000L
adafruit_trellis_m4.menu.speed.150=150 MHz (overclock)
adafruit_trellis_m4.menu.speed.150.build.f_cpu=150000000L
adafruit_trellis_m4.menu.speed.180=180 MHz (overclock)
adafruit_trellis_m4.menu.speed.180.build.f_cpu=180000000L
adafruit_trellis_m4.menu.speed.200=200 MHz (overclock)
adafruit_trellis_m4.menu.speed.200.build.f_cpu=200000000L
adafruit_trellis_m4.menu.opt.small=Small (-Os) (standard)
adafruit_trellis_m4.menu.opt.small.build.flags.optimize=-Os
adafruit_trellis_m4.menu.opt.fast=Fast (-O2)
adafruit_trellis_m4.menu.opt.fast.build.flags.optimize=-O2
adafruit_trellis_m4.menu.opt.faster=Faster (-O3)
adafruit_trellis_m4.menu.opt.faster.build.flags.optimize=-O3
adafruit_trellis_m4.menu.opt.fastest=Fastest (-Ofast)
adafruit_trellis_m4.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_trellis_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_trellis_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_trellis_m4.menu.maxqspi.50=50 MHz (standard)
adafruit_trellis_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
adafruit_trellis_m4.menu.maxqspi.fcpu=CPU Speed / 2
adafruit_trellis_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
adafruit_trellis_m4.menu.usbstack.arduino=Arduino
adafruit_trellis_m4.menu.usbstack.tinyusb=TinyUSB
adafruit_trellis_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_trellis_m4.menu.debug.off=Off
adafruit_trellis_m4.menu.debug.on=On
adafruit_trellis_m4.menu.debug.on.build.flags.debug=-g

# Adafruit PyPortal M4 (SAMD51)
# ------------------------------
adafruit_pyportal_m4.name=Adafruit PyPortal M4 (SAMD51)
adafruit_pyportal_m4.vid.0=0x239A
adafruit_pyportal_m4.pid.0=0x8035
adafruit_pyportal_m4.vid.1=0x239A
adafruit_pyportal_m4.pid.1=0x0035
adafruit_pyportal_m4.upload.tool=bossac18
adafruit_pyportal_m4.upload.protocol=sam-ba
adafruit_pyportal_m4.upload.maximum_size=1032192
adafruit_pyportal_m4.upload.offset=0x4000
adafruit_pyportal_m4.upload.use_1200bps_touch=true
adafruit_pyportal_m4.upload.wait_for_upload_port=true
adafruit_pyportal_m4.upload.native_usb=true
adafruit_pyportal_m4.build.mcu=cortex-m4
#adafruit_pyportal_m4.build.f_cpu=120000000L
adafruit_pyportal_m4.build.usb_product="Adafruit PyPortal M4"
adafruit_pyportal_m4.build.usb_manufacturer="Adafruit LLC"
adafruit_pyportal_m4.build.board=PYPORTAL_M4
adafruit_pyportal_m4.build.core=arduino
adafruit_pyportal_m4.build.extra_flags=-D__SAMD51J20A__ -DADAFRUIT_PYPORTAL -DCRYSTALLESS -D__SAMD51__ -DADAFRUIT_ARCH_SAMD {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
adafruit_pyportal_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_pyportal_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
adafruit_pyportal_m4.build.variant=pyportal_m4
adafruit_pyportal_m4.build.variant_system_lib=
adafruit_pyportal_m4.build.vid=0x239A
adafruit_pyportal_m4.build.pid=0x8035
adafruit_pyportal_m4.bootloader.tool=openocd
adafruit_pyportal_m4.bootloader.file=metroM4/bootloader-metro_m4-v2.0.0-adafruit.5.bin
adafruit_pyportal_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
adafruit_pyportal_m4.menu.cache.on=Enabled
adafruit_pyportal_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
adafruit_pyportal_m4.menu.cache.off=Disabled
adafruit_pyportal_m4.menu.cache.off.build.cache_flags=
adafruit_pyportal_m4.menu.speed.120=120 MHz (standard)
adafruit_pyportal_m4.menu.speed.120.build.f_cpu=120000000L
adafruit_pyportal_m4.menu.speed.150=150 MHz (overclock)
adafruit_pyportal_m4.menu.speed.150.build.f_cpu=150000000L
adafruit_pyportal_m4.menu.speed.180=180 MHz (overclock)
adafruit_pyportal_m4.menu.speed.180.build.f_cpu=180000000L
adafruit_pyportal_m4.menu.speed.200=200 MHz (overclock)
adafruit_pyportal_m4.menu.speed.200.build.f_cpu=200000000L
adafruit_pyportal_m4.menu.opt.small=Small (-Os) (standard)
adafruit_pyportal_m4.menu.opt.small.build.flags.optimize=-Os
adafruit_pyportal_m4.menu.opt.fast=Fast (-O2)
adafruit_pyportal_m4.menu.opt.fast.build.flags.optimize=-O2
adafruit_pyportal_m4.menu.opt.faster=Faster (-O3)
adafruit_pyportal_m4.menu.opt.faster.build.flags.optimize=-O3
adafruit_pyportal_m4.menu.opt.fastest=Fastest (-Ofast)
adafruit_pyportal_m4.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_pyportal_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_pyportal_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_pyportal_m4.menu.maxqspi.50=50 MHz (standard)
adafruit_pyportal_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
adafruit_pyportal_m4.menu.maxqspi.fcpu=CPU Speed / 2
adafruit_pyportal_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
adafruit_pyportal_m4.menu.usbstack.arduino=Arduino
adafruit_pyportal_m4.menu.usbstack.tinyusb=TinyUSB
adafruit_pyportal_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_pyportal_m4.menu.debug.off=Off
adafruit_pyportal_m4.menu.debug.on=On
adafruit_pyportal_m4.menu.debug.on.build.flags.debug=-g

# Adafruit PyPortal M4 Titano (SAMD51)
# ------------------------------
adafruit_pyportal_m4_titano.name=Adafruit PyPortal M4 Titano (SAMD51)
adafruit_pyportal_m4_titano.vid.0=0x239A
adafruit_pyportal_m4_titano.pid.0=0x8053
adafruit_pyportal_m4_titano.vid.1=0x239A
adafruit_pyportal_m4_titano.pid.1=0x8053
adafruit_pyportal_m4_titano.upload.tool=bossac18
adafruit_pyportal_m4_titano.upload.protocol=sam-ba
adafruit_pyportal_m4_titano.upload.maximum_size=1032192
adafruit_pyportal_m4_titano.upload.offset=0x4000
adafruit_pyportal_m4_titano.upload.use_1200bps_touch=true
adafruit_pyportal_m4_titano.upload.wait_for_upload_port=true
adafruit_pyportal_m4_titano.upload.native_usb=true
adafruit_pyportal_m4_titano.build.mcu=cortex-m4
#adafruit_pyportal_m4_titano.build.f_cpu=120000000L
adafruit_pyportal_m4_titano.build.usb_product="Adafruit PyPortal M4 Titano"
adafruit_pyportal_m4_titano.build.usb_manufacturer="Adafruit LLC"
adafruit_pyportal_m4_titano.build.board=PYPORTAL_M4_TITANO
adafruit_pyportal_m4_titano.build.core=arduino
adafruit_pyportal_m4_titano.build.extra_flags=-D__SAMD51J20A__ -DADAFRUIT_PYPORTAL_M4_TITANO -DCRYSTALLESS -D__SAMD51__ -DADAFRUIT_ARCH_SAMD {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
adafruit_pyportal_m4_titano.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_pyportal_m4_titano.build.openocdscript=openocd_scripts/arduino_zero.cfg
adafruit_pyportal_m4_titano.build.variant=pyportal_m4_titano
adafruit_pyportal_m4_titano.build.variant_system_lib=
adafruit_pyportal_m4_titano.build.vid=0x239A
adafruit_pyportal_m4_titano.build.pid=0x8035
adafruit_pyportal_m4_titano.bootloader.tool=openocd
adafruit_pyportal_m4_titano.bootloader.file=metroM4/bootloader-metro_m4-v2.0.0-adafruit.5.bin
adafruit_pyportal_m4_titano.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
adafruit_pyportal_m4_titano.menu.cache.on=Enabled
adafruit_pyportal_m4_titano.menu.cache.on.build.cache_flags=-DENABLE_CACHE
adafruit_pyportal_m4_titano.menu.cache.off=Disabled
adafruit_pyportal_m4_titano.menu.cache.off.build.cache_flags=
adafruit_pyportal_m4_titano.menu.speed.120=120 MHz (standard)
adafruit_pyportal_m4_titano.menu.speed.120.build.f_cpu=120000000L
adafruit_pyportal_m4_titano.menu.speed.150=150 MHz (overclock)
adafruit_pyportal_m4_titano.menu.speed.150.build.f_cpu=150000000L
adafruit_pyportal_m4_titano.menu.speed.180=180 MHz (overclock)
adafruit_pyportal_m4_titano.menu.speed.180.build.f_cpu=180000000L
adafruit_pyportal_m4_titano.menu.speed.200=200 MHz (overclock)
adafruit_pyportal_m4_titano.menu.speed.200.build.f_cpu=200000000L
adafruit_pyportal_m4_titano.menu.opt.small=Small (-Os) (standard)
adafruit_pyportal_m4_titano.menu.opt.small.build.flags.optimize=-Os
adafruit_pyportal_m4_titano.menu.opt.fast=Fast (-O2)
adafruit_pyportal_m4_titano.menu.opt.fast.build.flags.optimize=-O2
adafruit_pyportal_m4_titano.menu.opt.faster=Faster (-O3)
adafruit_pyportal_m4_titano.menu.opt.faster.build.flags.optimize=-O3
adafruit_pyportal_m4_titano.menu.opt.fastest=Fastest (-Ofast)
adafruit_pyportal_m4_titano.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_pyportal_m4_titano.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_pyportal_m4_titano.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_pyportal_m4_titano.menu.maxqspi.50=50 MHz (standard)
adafruit_pyportal_m4_titano.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
adafruit_pyportal_m4_titano.menu.maxqspi.fcpu=CPU Speed / 2
adafruit_pyportal_m4_titano.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
adafruit_pyportal_m4_titano.menu.usbstack.arduino=Arduino
adafruit_pyportal_m4_titano.menu.usbstack.tinyusb=TinyUSB
adafruit_pyportal_m4_titano.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_pyportal_m4_titano.menu.debug.off=Off
adafruit_pyportal_m4_titano.menu.debug.on=On
adafruit_pyportal_m4_titano.menu.debug.on.build.flags.debug=-g

