arduino/ArduinoCore-samd/boards.txt
# Adafruit pyBadge AirLift M4 (SAMD51)
# ------------------------------
adafruit_pybadge_airlift_m4.name=Adafruit pyBadge AirLift M4 (SAMD51)
adafruit_pybadge_airlift_m4.vid.0=0x239A
adafruit_pybadge_airlift_m4.pid.0=0x8043
adafruit_pybadge_airlift_m4.vid.1=0x239A
adafruit_pybadge_airlift_m4.pid.1=0x0033
adafruit_pybadge_airlift_m4.vid.1=0x239A
adafruit_pybadge_airlift_m4.pid.1=0x8043
adafruit_pybadge_airlift_m4.upload.tool=bossac18
adafruit_pybadge_airlift_m4.upload.protocol=sam-ba
adafruit_pybadge_airlift_m4.upload.maximum_size=1032192
adafruit_pybadge_airlift_m4.upload.offset=0x4000
adafruit_pybadge_airlift_m4.upload.use_1200bps_touch=true
adafruit_pybadge_airlift_m4.upload.wait_for_upload_port=true
adafruit_pybadge_airlift_m4.upload.native_usb=true
adafruit_pybadge_airlift_m4.build.mcu=cortex-m4
#adafruit_pybadge_airlift_m4.build.f_cpu=120000000L
adafruit_pybadge_airlift_m4.build.usb_product="Adafruit pyBadge AirLift M4"
adafruit_pybadge_airlift_m4.build.usb_manufacturer="Adafruit LLC"
adafruit_pybadge_airlift_m4.build.board=PYBADGE_AIRLIFT_M4
adafruit_pybadge_airlift_m4.build.core=arduino
adafruit_pybadge_airlift_m4.build.extra_flags=-D__SAMD51J20A__ -DADAFRUIT_PYBADGE_AIRLIFT_M4 -DCRYSTALLESS -D__SAMD51__ -DADAFRUIT_ARCH_SAMD {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
adafruit_pybadge_airlift_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_pybadge_airlift_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
adafruit_pybadge_airlift_m4.build.variant=pybadge_airlift_m4
adafruit_pybadge_airlift_m4.build.variant_system_lib=
adafruit_pybadge_airlift_m4.build.vid=0x239A
adafruit_pybadge_airlift_m4.build.pid=0x8043
adafruit_pybadge_airlift_m4.bootloader.tool=openocd
adafruit_pybadge_airlift_m4.bootloader.file=featherM4/bootloader-feather_m4-v2.0.0-adafruit.5.bin
adafruit_pybadge_airlift_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
adafruit_pybadge_airlift_m4.menu.cache.on=Enabled
adafruit_pybadge_airlift_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
adafruit_pybadge_airlift_m4.menu.cache.off=Disabled
adafruit_pybadge_airlift_m4.menu.cache.off.build.cache_flags=
adafruit_pybadge_airlift_m4.menu.speed.120=120 MHz (standard)
adafruit_pybadge_airlift_m4.menu.speed.120.build.f_cpu=120000000L
adafruit_pybadge_airlift_m4.menu.speed.150=150 MHz (overclock)
adafruit_pybadge_airlift_m4.menu.speed.150.build.f_cpu=150000000L
adafruit_pybadge_airlift_m4.menu.speed.180=180 MHz (overclock)
adafruit_pybadge_airlift_m4.menu.speed.180.build.f_cpu=180000000L
adafruit_pybadge_airlift_m4.menu.speed.200=200 MHz (overclock)
adafruit_pybadge_airlift_m4.menu.speed.200.build.f_cpu=200000000L
adafruit_pybadge_airlift_m4.menu.opt.small=Small (-Os) (standard)
adafruit_pybadge_airlift_m4.menu.opt.small.build.flags.optimize=-Os
adafruit_pybadge_airlift_m4.menu.opt.fast=Fast (-O2)
adafruit_pybadge_airlift_m4.menu.opt.fast.build.flags.optimize=-O2
adafruit_pybadge_airlift_m4.menu.opt.faster=Faster (-O3)
adafruit_pybadge_airlift_m4.menu.opt.faster.build.flags.optimize=-O3
adafruit_pybadge_airlift_m4.menu.opt.fastest=Fastest (-Ofast)
adafruit_pybadge_airlift_m4.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_pybadge_airlift_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_pybadge_airlift_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_pybadge_airlift_m4.menu.maxqspi.50=50 MHz (standard)
adafruit_pybadge_airlift_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
adafruit_pybadge_airlift_m4.menu.maxqspi.fcpu=CPU Speed / 2
adafruit_pybadge_airlift_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
adafruit_pybadge_airlift_m4.menu.usbstack.arduino=Arduino
adafruit_pybadge_airlift_m4.menu.usbstack.tinyusb=TinyUSB
adafruit_pybadge_airlift_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_pybadge_airlift_m4.menu.debug.off=Off
adafruit_pybadge_airlift_m4.menu.debug.on=On
adafruit_pybadge_airlift_m4.menu.debug.on.build.flags.debug=-g


# Adafruit MONSTER M4SK Express (SAMD51)
# ------------------------------
adafruit_monster_m4sk.name=Adafruit MONSTER M4SK (SAMD51)
adafruit_monster_m4sk.vid.0=0x239A
adafruit_monster_m4sk.pid.0=0x8047
adafruit_monster_m4sk.vid.1=0x239A
adafruit_monster_m4sk.pid.1=0x0047
adafruit_monster_m4sk.vid.1=0x239A
adafruit_monster_m4sk.pid.1=0x8048
adafruit_monster_m4sk.upload.tool=bossac18
adafruit_monster_m4sk.upload.protocol=sam-ba
adafruit_monster_m4sk.upload.maximum_size=507904
adafruit_monster_m4sk.upload.offset=0x4000
adafruit_monster_m4sk.upload.use_1200bps_touch=true
adafruit_monster_m4sk.upload.wait_for_upload_port=true
adafruit_monster_m4sk.upload.native_usb=true
adafruit_monster_m4sk.build.mcu=cortex-m4
#adafruit_monster_m4sk.build.f_cpu=120000000L
adafruit_monster_m4sk.build.usb_product="Adafruit MONSTER M4SK"
adafruit_monster_m4sk.build.usb_manufacturer="Adafruit LLC"
adafruit_monster_m4sk.build.board=MONSTER_M4SK
adafruit_monster_m4sk.build.core=arduino
adafruit_monster_m4sk.build.extra_flags=-D__SAMD51G19A__ -DADAFRUIT_MONSTER_M4SK_EXPRESS -DCRYSTALLESS -D__SAMD51__ -DADAFRUIT_ARCH_SAMD {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
adafruit_monster_m4sk.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_monster_m4sk.build.openocdscript=openocd_scripts/arduino_zero.cfg
adafruit_monster_m4sk.build.variant=monster_m4sk
adafruit_monster_m4sk.build.variant_system_lib=
adafruit_monster_m4sk.build.vid=0x239A
adafruit_monster_m4sk.build.pid=0x8047
adafruit_monster_m4sk.bootloader.tool=openocd
adafruit_monster_m4sk.bootloader.file=featherM4/bootloader-feather_m4-v2.0.0-adafruit.5.bin
adafruit_monster_m4sk.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
adafruit_monster_m4sk.menu.cache.on=Enabled
adafruit_monster_m4sk.menu.cache.on.build.cache_flags=-DENABLE_CACHE
adafruit_monster_m4sk.menu.cache.off=Disabled
adafruit_monster_m4sk.menu.cache.off.build.cache_flags=
adafruit_monster_m4sk.menu.speed.120=120 MHz (standard)
adafruit_monster_m4sk.menu.speed.120.build.f_cpu=120000000L
adafruit_monster_m4sk.menu.speed.150=150 MHz (overclock)
adafruit_monster_m4sk.menu.speed.150.build.f_cpu=150000000L
adafruit_monster_m4sk.menu.speed.180=180 MHz (overclock)
adafruit_monster_m4sk.menu.speed.180.build.f_cpu=180000000L
adafruit_monster_m4sk.menu.speed.200=200 MHz (overclock)
adafruit_monster_m4sk.menu.speed.200.build.f_cpu=200000000L
adafruit_monster_m4sk.menu.opt.small=Small (-Os) (standard)
adafruit_monster_m4sk.menu.opt.small.build.flags.optimize=-Os
adafruit_monster_m4sk.menu.opt.fast=Fast (-O2)
adafruit_monster_m4sk.menu.opt.fast.build.flags.optimize=-O2
adafruit_monster_m4sk.menu.opt.faster=Faster (-O3)
adafruit_monster_m4sk.menu.opt.faster.build.flags.optimize=-O3
adafruit_monster_m4sk.menu.opt.fastest=Fastest (-Ofast)
adafruit_monster_m4sk.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_monster_m4sk.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_monster_m4sk.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_monster_m4sk.menu.maxqspi.50=50 MHz (standard)
adafruit_monster_m4sk.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
adafruit_monster_m4sk.menu.maxqspi.fcpu=CPU Speed / 2
adafruit_monster_m4sk.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
adafruit_monster_m4sk.menu.usbstack.arduino=Arduino
adafruit_monster_m4sk.menu.usbstack.tinyusb=TinyUSB
adafruit_monster_m4sk.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_monster_m4sk.menu.debug.off=Off
adafruit_monster_m4sk.menu.debug.on=On
adafruit_monster_m4sk.menu.debug.on.build.flags.debug=-g


# Adafruit Hallowing M4 Express (SAMD51)
# ------------------------------
adafruit_hallowing_m4.name=Adafruit Hallowing M4 (SAMD51)
adafruit_hallowing_m4.vid.0=0x239A
adafruit_hallowing_m4.pid.0=0x8049
adafruit_hallowing_m4.vid.1=0x239A
adafruit_hallowing_m4.pid.1=0x0049
adafruit_hallowing_m4.vid.1=0x239A
adafruit_hallowing_m4.pid.1=0x804A
adafruit_hallowing_m4.upload.tool=bossac18
adafruit_hallowing_m4.upload.protocol=sam-ba
adafruit_hallowing_m4.upload.maximum_size=507904
adafruit_hallowing_m4.upload.offset=0x4000
adafruit_hallowing_m4.upload.use_1200bps_touch=true
adafruit_hallowing_m4.upload.wait_for_upload_port=true
adafruit_hallowing_m4.upload.native_usb=true
adafruit_hallowing_m4.build.mcu=cortex-m4
#adafruit_hallowing_m4.build.f_cpu=120000000L
adafruit_hallowing_m4.build.usb_product="Adafruit Hallowing M4"
adafruit_hallowing_m4.build.usb_manufacturer="Adafruit LLC"
adafruit_hallowing_m4.build.board=HALLOWING_M4
adafruit_hallowing_m4.build.core=arduino
adafruit_hallowing_m4.build.extra_flags=-D__SAMD51J19A__ -DADAFRUIT_HALLOWING_M4_EXPRESS -DCRYSTALLESS -D__SAMD51__ -DADAFRUIT_ARCH_SAMD {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
adafruit_hallowing_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_hallowing_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
adafruit_hallowing_m4.build.variant=hallowing_m4
adafruit_hallowing_m4.build.variant_system_lib=
adafruit_hallowing_m4.build.vid=0x239A
adafruit_hallowing_m4.build.pid=0x8049
adafruit_hallowing_m4.bootloader.tool=openocd
adafruit_hallowing_m4.bootloader.file=featherM4/bootloader-feather_m4-v2.0.0-adafruit.5.bin
adafruit_hallowing_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
adafruit_hallowing_m4.menu.cache.on=Enabled
adafruit_hallowing_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
adafruit_hallowing_m4.menu.cache.off=Disabled
adafruit_hallowing_m4.menu.cache.off.build.cache_flags=
adafruit_hallowing_m4.menu.speed.120=120 MHz (standard)
adafruit_hallowing_m4.menu.speed.120.build.f_cpu=120000000L
adafruit_hallowing_m4.menu.speed.150=150 MHz (overclock)
adafruit_hallowing_m4.menu.speed.150.build.f_cpu=150000000L
adafruit_hallowing_m4.menu.speed.180=180 MHz (overclock)
adafruit_hallowing_m4.menu.speed.180.build.f_cpu=180000000L
adafruit_hallowing_m4.menu.speed.200=200 MHz (overclock)
adafruit_hallowing_m4.menu.speed.200.build.f_cpu=200000000L
adafruit_hallowing_m4.menu.opt.small=Small (-Os) (standard)
adafruit_hallowing_m4.menu.opt.small.build.flags.optimize=-Os
adafruit_hallowing_m4.menu.opt.fast=Fast (-O2)
adafruit_hallowing_m4.menu.opt.fast.build.flags.optimize=-O2
adafruit_hallowing_m4.menu.opt.faster=Faster (-O3)
adafruit_hallowing_m4.menu.opt.faster.build.flags.optimize=-O3
adafruit_hallowing_m4.menu.opt.fastest=Fastest (-Ofast)
adafruit_hallowing_m4.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_hallowing_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_hallowing_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_hallowing_m4.menu.maxqspi.50=50 MHz (standard)
adafruit_hallowing_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
adafruit_hallowing_m4.menu.maxqspi.fcpu=CPU Speed / 2
adafruit_hallowing_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
adafruit_hallowing_m4.menu.usbstack.arduino=Arduino
adafruit_hallowing_m4.menu.usbstack.tinyusb=TinyUSB
adafruit_hallowing_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_hallowing_m4.menu.debug.off=Off
adafruit_hallowing_m4.menu.debug.on=On
adafruit_hallowing_m4.menu.debug.on.build.flags.debug=-g

